In [1]:
import numpy as np
import pandas as pd

In [2]:
# create list

list1 = [1,2,3,4]
list2 = [-1,-2,-3,-4]
list3 = [ list1, list2  ]
print(list3)

[[1, 2, 3, 4], [-1, -2, -3, -4]]

In [3]:
# ar_list1 =  array("i", list1)  # doesnt work

In [4]:
# list to array

array1 = np.array(list1)
print(array1)

[1 2 3 4]

In [5]:
print(sum(array1))
print(array1[0])

10
1

In [6]:
dimArray = np.array( list3 )

In [7]:
print ( dimArray )

[[ 1  2  3  4]
 [-1 -2 -3 -4]]

In [8]:
print( dimArray[1][0] )

-1

In [9]:
#increrment all by 1
dimArray = dimArray +1

In [10]:
# list to series ( with default index )
print ( pd.Series(list1) )

# array to series also works 
print ( pd.Series(array1) )

0    1
1    2
2    3
3    4
dtype: int64
0    1
1    2
2    3
3    4
dtype: int32

In [11]:
# Series with explicit index
#print ( pd.Series(array1, index=['zero', 'one', 'two', 'three']) )

indexedSeries = pd.Series(array1, index=['zero', 'one', 'two', 'three'])

In [12]:
print(indexedSeries)

zero     1
one      2
two      3
three    4
dtype: int32

In [13]:


df = pd.DataFrame([
  ['January', 100, 100, 23, 100],
  ['February', 51, 45, 145, 45],
  ['March', 81, 96, 65, 96],
  ['April', 80, 80, 54, 180],
  ['May', 51, 54, 54, 154],
  ['June', 112, 109, 79, 129]],
  columns=['month', 'clinic_east',
           'clinic_north', 'clinic_south',
           'clinic_west']
)

In [14]:
print(df)

      month  clinic_east  clinic_north  clinic_south  clinic_west
0   January          100           100            23          100
1  February           51            45           145           45
2     March           81            96            65           96
3     April           80            80            54          180
4       May           51            54            54          154
5      June          112           109            79          129

In [15]:
# slice rows : these give the same output

print(df[1:3])
print(df.iloc[1:3])

      month  clinic_east  clinic_north  clinic_south  clinic_west
1  February           51            45           145           45
2     March           81            96            65           96
      month  clinic_east  clinic_north  clinic_south  clinic_west
1  February           51            45           145           45
2     March           81            96            65           96

In [16]:
# slice rows : these also give the same output

print(df[ 3: ])
print(df[ -3: ])

   month  clinic_east  clinic_north  clinic_south  clinic_west
3  April           80            80            54          180
4    May           51            54            54          154
5   June          112           109            79          129
   month  clinic_east  clinic_north  clinic_south  clinic_west
3  April           80            80            54          180
4    May           51            54            54          154
5   June          112           109            79          129

In [17]:
# try skip step 
## [ start : end : interval ] 

df[0:4:2] # doesnt work with a straight slice
#df.iloc[0:4]

     month  clinic_east  clinic_north  clinic_south  clinic_west
0  January          100           100            23          100
2    March           81            96            65           96

In [18]:
# instruction

april_may_june = df[ 3: ]

april_may_june

   month  clinic_east  clinic_north  clinic_south  clinic_west
3  April           80            80            54          180
4    May           51            54            54          154
5   June          112           109            79          129

In [19]:
#########
## Select with conditions
###############

In [20]:
df = pd.DataFrame([
  ['January', 100, 100, 23, 100],
  ['February', 51, 45, 145, 45],
  ['March', 81, 96, 65, 96],
  ['April', 80, 80, 54, 180],
  ['May', 51, 54, 54, 154],
  ['June', 112, 109, 79, 129]],
  columns=['month', 'clinic_east',
           'clinic_north', 'clinic_south',
           'clinic_west'])

In [21]:
#df

In [22]:
# lambda refresher

f = lambda n : n * 5
f(3)

15

In [23]:
# select WHERE, single condition
# df[ df.column <op> condition ]

df[ df.clinic_east > 51 ]

     month  clinic_east  clinic_north  clinic_south  clinic_west
0  January          100           100            23          100
2    March           81            96            65           96
3    April           80            80            54          180
5     June          112           109            79          129

In [24]:
## instruction
# Create variable january using a logical statement that selects the row of df where the 'month' column is 'January'. 

january = df[ df.month ==  'January' ]
#january

In [25]:
# select WHERE, multiple conditions
# df[  ( df.column <op> condition )  |/& ( df.column <op> condition ) ]
## * for more than 2 conditions, AND (&) is evaluated before OR (|)

In [26]:
## instruction
# Create the variable march_april, which contains the data from March and April. Do this using two logical statements combined using |, which means “or”.

march_april = df[ ( df.month == 'March' ) | ( df.month == 'April' ) ]
#march_april = df.clinic_north[ ( df.month == 'March' ) | ( df.month == 'April' ) ]


print(march_april)

   month  clinic_east  clinic_north  clinic_south  clinic_west
2  March           81            96            65           96
3  April           80            80            54          180

In [27]:
# select WHERE, using ISIN

# df[df.<column>.isin([value, value, value])]

In [28]:
df[df.clinic_east.isin([80, 81])]

   month  clinic_east  clinic_north  clinic_south  clinic_west
2  March           81            96            65           96
3  April           80            80            54          180

In [29]:
## instruction
# Create the variable january_february_march, containing the data from January, February, and March. Do this using a single logical statement with the isin command.

january_february_march = df[df.month.isin(['January', 'February', 'March'])]

print(january_february_march)

      month  clinic_east  clinic_north  clinic_south  clinic_west
0   January          100           100            23          100
1  February           51            45           145           45
2     March           81            96            65           96

In [30]:
# Reset index on extracted slice

In [31]:
df[ df.clinic_east == 51 ]

# notice the index 1,4 is fragmented

      month  clinic_east  clinic_north  clinic_south  clinic_west
1  February           51            45           145           45
4       May           51            54            54          154

In [32]:
df[ df.clinic_east == 51 ].reset_index()

# FIXED, sorta, though old values remain in a new column, index

   index     month  clinic_east  clinic_north  clinic_south  clinic_west
0      1  February           51            45           145           45
1      4       May           51            54            54          154

In [33]:
df[ df.clinic_east == 51 ].reset_index( drop = True )  # drop = True removes the old index values

      month  clinic_east  clinic_north  clinic_south  clinic_west
0  February           51            45           145           45
1       May           51            54            54          154

In [34]:
# Note, both these operations create a new dataframe with the result set. 'df' is not effected.
#df

In [35]:
# use inplace=True to modify a dataframe in place

df[ df.clinic_east < 80 ].reset_index(inplace=True   )

In [36]:
df

      month  clinic_east  clinic_north  clinic_south  clinic_west
0   January          100           100            23          100
1  February           51            45           145           45
2     March           81            96            65           96
3     April           80            80            54          180
4       May           51            54            54          154
5      June          112           109            79          129

In [37]:
# New method :: loc[] to access rows
df.loc[[1, 3, 5]]

#df.loc[[1, 3, 5]].reset_index()

      month  clinic_east  clinic_north  clinic_south  clinic_west
1  February           51            45           145           45
3     April           80            80            54          180
5      June          112           109            79          129

In [38]:
df2 = df.loc[[1, 3, 5]]
df2

      month  clinic_east  clinic_north  clinic_south  clinic_west
1  February           51            45           145           45
3     April           80            80            54          180
5      June          112           109            79          129

In [39]:
## instruction
# Create a new DataFrame called df3 by resetting the indices on df2 (don’t use inplace or drop). Did df2 change after you ran this command?

df3 = df2.reset_index()
df3

   index     month  clinic_east  clinic_north  clinic_south  clinic_west
0      1  February           51            45           145           45
1      3     April           80            80            54          180
2      5      June          112           109            79          129

In [40]:
# Reset the indices of df2 by using the keyword inplace=True and drop=True. Did the indices of df2 change? How is df2 different from df3?

df2.reset_index(drop=True, inplace=True)
df2

      month  clinic_east  clinic_north  clinic_south  clinic_west
0  February           51            45           145           45
1     April           80            80            54          180
2      June          112           109            79          129

In [41]:
###
#  Excursion : using reset_index() to force a numeric index on a df that has been indexed on another non-numeric column
####

#df_networkProject = pd.read_csv('Nodes_IN_Medium.csv')

In [42]:
#type(df_networkProject)
#df_networkProject.head(5)

In [43]:
# set the df index to nodename

#df_networkProject.set_index('nodename', inplace = True)

In [44]:
# now reset the index

#df_networkProject.reset_index(inplace=True)

# WORKS!

In [45]:
####################
# Exercise
#################

#In this example, you’ll be the data analyst for ShoeFly.com, a fictional online shoe store. You’ve seen this data; now it’s your turn to work with it!

In [46]:
# Load the data from shoefly.csv into the variable orders 

#orders = pd.read_csv('shoefly.csv')

In [47]:
# Inspect the first 5 lines of the data.

#orders.head(5) # no good; Excel didnt parse it; its all in 1 column... FIXED

In [48]:
# Select all of the email addresses from the column email and save them to a variable called emails

#orders['email']

In [49]:
# Frances Palmer claims that her order was wrong. What did Frances Palmer order? Use logic to select that row of orders and save it to the variable frances_palmer

#frances_palmer = orders[ ( orders.first_name  == 'Frances' ) & ( orders.last_name == 'Palmer'  )  ]
#print(type(frances_palmer))  # even this single line result is of type data frame
#frances_palmer

In [50]:
# We need some customer reviews for our comfortable shoes. Select all orders for shoe_type: clogs, boots, and ballet flats and save them to the variable comfy_shoes.

#comfy_shoes = orders[ orders.shoe_type.isin(  [ 'clogs', 'boots', 'ballet flats' ] ) ]

#print( comfy_shoes )
#comfy_shoes

In [51]:
##############
# Modifying a DataFrame
#################

In [52]:
## Adding a Column I

In [53]:
df = pd.DataFrame([
  [1, '3 inch screw', 0.5, 0.75],
  [2, '2 inch nail', 0.10, 0.25],
  [3, 'hammer', 3.00, 5.50],
  [4, 'screwdriver', 2.50, 3.00]
],
  columns=['Product ID', 'Description', 'Cost to Manufacture', 'Price']
)

In [54]:
# The DataFrame df contains information on products sold at a hardware store. Add a column to df called 'Sold in Bulk?', which indicates if the product is sold in bulk or individually. The final table should look like this:

In [55]:
df['Sold in Bulk?'] = [ 'Yes', 'Yes', 'No', 'No' ]

In [56]:
# Add a column to df called Is taxed?, which indicates whether or not to collect sales tax on the product. It should be 'Yes' for all rows.

In [57]:
df['Is taxed?'] = 'Yes'

In [58]:
## Using apply() to modify a column

df['Is taxed?'] = df["Is taxed?"].apply(str.upper) # dot . notation can be used to designate columns by exact name , only w/o whitespace

In [59]:
## Instruction: Apply the function lower to all names in column 'Name' in df. Assign these new names to a new column of df called 'Lowercase Name'. 

df2 = pd.DataFrame([
  ['JOHN SMITH', 'john.smith@gmail.com'],
  ['Jane Doe', 'jdoe@yahoo.com'],
  ['joe schmo', 'joeschmo@hotmail.com']
],
columns=['Name', 'Email'])

In [60]:
df2['Lowercase Name'] = df2['Name'].apply(str.lower)

In [61]:
df2

         Name                 Email Lowercase Name
0  JOHN SMITH  john.smith@gmail.com     john smith
1    Jane Doe        jdoe@yahoo.com       jane doe
2   joe schmo  joeschmo@hotmail.com      joe schmo

In [62]:
## Modifying a data frame with lambdas

In [63]:
## Instruction : Create a lambda function mylambda that returns the first and last letters of a string, assuming the string is at least 2 characters long. For example,

mylambda = lambda str :  str[0] + str[-1] if len(str) > 1 else 'too short, shorty!'

In [64]:
mylambda('E')

'too short, shorty!'

In [65]:
# Cool use of apply() with a lambda
df2['NameFirstAndLast'] = df2.Name.apply(mylambda)

In [66]:
df2

         Name                 Email Lowercase Name NameFirstAndLast
0  JOHN SMITH  john.smith@gmail.com     john smith               JH
1    Jane Doe        jdoe@yahoo.com       jane doe               Je
2   joe schmo  joeschmo@hotmail.com      joe schmo               jo

In [67]:
## Instruction: You are managing the webpage of a somewhat violent video game and you want to check that each user’s age is 13 or greater when they visit the site.
#Write a lambda function that takes an inputted age and either returns Welcome to BattleCity! bif the user is 13 or older or You must be 13 or older if they are younger than 13. Your lambda function should be called mylambda.


mylambda = lambda age : 'Welcome to BattleCity!' if age >= 13 else 'You must be 13 or older'

In [68]:
mylambda(11)

'You must be 13 or older'

In [69]:
## Instruction: Create a lambda function get_last_name which takes a string with someone’s first and last name (i.e., John Smith), and returns just the last name (i.e., Smith).

In [70]:
get_last_name = lambda fName : fName.split(' ')[-1]

In [71]:
get_last_name('Eric Smyth')

'Smyth'

In [72]:

## Instruction: Use the lambda function get_last_name to create a new column last_name with only the employees’ last name.
df = pd.DataFrame([
  [1, '3 inch screw', 0.5, 0.75],
  [2, '2 inch nail', 0.10, 0.25],
  [3, 'hammer', 3.00, 5.50],
  [4, 'screwdriver', 2.50, 3.00]
],
  columns=['Product ID', 'Description', 'Cost to Manufacture', 'Price']
)

#df[]

In [73]:
df['Is taxed?'] = [True, False, False, True]

In [74]:
df['Price with Tax'] = df.apply(lambda row:
     round(row['Price'] * 1.075, 2)
     if row['Is taxed?'] == True
     else round(row['Price'], 2),
     axis=1
)

In [75]:
# use this repeatedly where payroll data is needed
# The DataFrame df represents the hours worked by different employees over the course of the week. It contains the following columns:

df = pd.read_csv( '../employees.csv' )

In [76]:
df['last_name'] = df.name.apply( get_last_name) ### dont pass an empty () when calling a lambda; pass nothing

In [77]:
#df

In [78]:
############
## Applying a Lambda to a Row ( use axis = 1 ) - this is for conditional updates , i.e. WHERE
#############
#We can also operate on multiple columns at once. If we use apply without specifying a single column and add the argument axis=1, the input to our lambda function will be an entire row, not a column. To access particular values of the row, we use the syntax row.column_name or row[‘column_name’].

# df2 = df.apply( lambda row : row['Gravy'] = True if row['Cost to Manufacture'] < 0.9 else row['Gravy'] = False, axis = 1 ) # broken

In [79]:
# ... but how is this different from

calcPriceWithTax = lambda price : round(row['Price'] * 1.075, 2) if df['Is taxed']  == True else round(row['Price'], 2)

# df[ 'Price with Tax by Column' ] = df.apply( calcPriceWithTax  ) ## this doesnt work
#df[ 'Price with Tax by Column' ] = df.apply( lambda cell :   )

In [80]:
# Task: If an employee worked for more than 40 hours, she needs to be paid overtime (1.5 times the normal hourly wage).

# For instance, if an employee worked for 43 hours and made $10/hour, she would receive $400 for the first 40 hours that she worked, and an additional $45 for the 3 hours of overtime, for a total for $445.

# Create a lambda function total_earned that accepts an input row with keys hours_worked and hourly_wage and uses an if statement to calculate the total wages earned.



#total_earned = lambda row :  int( ( row.hours_worked - 40)  ) * int( ( row.hourly_wage * 1.5 ) ) +  ( int( ( row.hourly_wage * 40)  ) )  if int(row.hours_worked) > 40 else int ( row.hours_worked)  *  int(row.hourly_wage )

### This is the model function to use ; the int() conversions are only needed when using incorrect df[0:1] reference
total_earned = lambda row :   ( row.hours_worked - 40)   *  ( row.hourly_wage * 1.5 )  +  ( ( row.hourly_wage * 40)  )   if row.hours_worked > 40 else row.hours_worked  *  row.hourly_wage

#total_earned = lambda row :  int( ( row.hours_worked - 40)  ) * int( ( row.hourly_wage * 1.5 ) ) +  ( int( ( row.hourly_wage * 40)  ) )  if int(row.hours_worked) > 40 else int (  ( row.hours_worked)  *  int(row.hourly_wage ))

In [81]:
row1 = df.iloc[3]

print(row1)

total_earned(row1)

#print( df[1] )

#total_earned( { hours_worked : 1,  hourly_wage : 10 } )    

## calc 760 base pay , 85.5 PT

id                    16886
name            Brian Rojas
hourly_wage              18
hours_worked             47
last_name             Rojas
Name: 3, dtype: object

909.0

In [82]:
##  id           name  hourly_wage  hours_worked
## 10310  Lauren Durham           19            43

# base pay: 40 hr @ 19.00 = 760.00 
# OT : 3 hr @ 28.50 = 85.50 
# total : 845.5

In [83]:
# type(row1)
# row1.hours_worked *  ( row1.hourly_wage * 1.5 )
# row1.hours_worked *  row1.hourly_wage
# result = row1.hours_worked *  row1.hourly_wage
# #type( int(result) )
# int(result)

In [84]:
# lambda not working; try a fn
## Solution : row.hours_worked and row.hourly_wage return as SERIES; must be converted into ints for use in calc

# def total_earned( row ):
#     #return( row.hours_worked )
#     if int(row.hours_worked) > 40:
        
#          #return( 'OT' )
#         return(  int(row.hours_worked) * 40 + (  ))
#     else:
#          return( 'straight pay' )

In [85]:
total_earned( row1 )

909.0

In [86]:
# Use the lambda function total_earned and apply to add a column total_earned to df with the total amount earned by each employee.

df['total_earned'] = df.apply( total_earned, axis = 1 )

In [87]:
#df['Taxable?'] = [True, False, False, True] 
#df

In [88]:
##### 
# Renaming columns
#########

#You can change all of the column names at once by setting the .columns property to a different list. This is great when you need to change all of the column names at once, but be careful! You can easily mislabel columns if you get the ordering wrong. Here’s an example:

df = pd.DataFrame({
    'name': ['John', 'Jane', 'Sue', 'Fred'],
    'age': [23, 29, 21, 18]
})
df.columns = ['First Name', 'Age']

In [89]:
## Instruction : The DataFrame df contains data about movies from IMDb.

# We want to present this data to some film producers. Right now, our column names are in lower case, and are not very descriptive. Let’s modify df using the .columns attribute to make the following changes to the columns:

# Old	New
# id	ID
# name	Title
# genre	Category
# year	Year Released
# imdb_rating	Rating

In [90]:
#df = pd.read_csv('imdb.csv')

df = pd.read_csv('imdb.csv.txt')

In [91]:
df.columns = [ 'ID', 'Title', 'Category', 'Year Released', 'Rating' ]

#max( df.year )

In [92]:
# You also can rename individual columns by using the .rename method. Pass a dictionary like the one below to the columns keyword argument

df = pd.DataFrame({
    'name': ['John', 'Jane', 'Sue', 'Fred'],
    'age': [23, 29, 21, 18]
})
df.rename(columns={
    'name': 'First Name',
    'age': 'Age'},
    inplace=True)

In [93]:
## Instruction
# If we didn’t know that df was a table of movie ratings, the column name might be confusing.

# To clarify, let’s rename name to movie_title.

# Use the keyword inplace=True so that you modify df rather than creating a new DataFrame!

reName =  { 'name' : 'movie_title' }

df.rename( columns=reName, inplace = True )

In [94]:
############# 
# Review

# Once more, you’ll be the data analyst for ShoeFly.com, a fictional online shoe store.

# More messy order data has been loaded into the variable orders. Examine the first 5 rows of the data using print and .head().

#orders = pd.read_csv('shoefly.csv')
orders = pd.read_csv('shoefly.csv.txt')

orders.head()

,id,first_name,last_name,gender,email,shoe_type,shoe_material,shoe_color
0,54791,Rebecca,Lindsay,female,RebeccaLindsay57@hotmail.com,clogs,faux-leather,black
1,53450,Emily,Joyce,female,EmilyJoyce25@gmail.com,ballet flats,faux-leather,navy
2,91987,Joyce,Waller,female,Joyce.Waller@gmail.com,sandles,fabric,black
3,14437,Justin,Erickson,male,Justin.Erickson@outlook.com,clogs,faux-leather,red
4,79357,Andrew,Banks,male,AB4318@gmail.com,boots,leather,brown

In [95]:
veganShoe = lambda row : 'vegan' if row.shoe_material != 'leather' else 'animal'

In [96]:
#orders.iloc[1]

In [97]:
print( veganShoe(orders.iloc[1]) )

vegan

In [98]:
######### instruction
# Many of our customers want to buy vegan shoes (shoes made from materials that do not come from animals). Add a new column called shoe_source, which is vegan if the materials is not leather and animal otherwise.
orders['shoe_source'] = orders.apply(lambda row : 'vegan' if row.shoe_material != 'leather' else 'animal' , axis = 1)

In [99]:
#orders

In [100]:
orders.iloc[1]['gender']
type(orders.iloc[1]['gender'])

str

In [101]:
def genderChecker( row ):
    #print( row.gender )
    if row.gender == 'male':
        print( row.gender )

In [102]:
 genderChecker( orders.iloc[3] )

male

In [103]:
###### instructiion
# Our marketing department wants to send out an email to each customer. Using the columns last_name and gender create a column called salutation which contains Dear Mr. <last_name> for men and Dear Ms. <last_name> for women.

salutationFinder = lambda row : str('Dear Mr. ' + row.last_name)\
if row.gender == 'male' else str('Dear Ms. ' + row.last_name) 

# note above, the newline character can be escaped out
#else 'nonbin'
#salutationFinder = ( lambda row : str('Dear Mr. ' + row.last_name) if true )

#salutationFinder = lambda row : 'howdy' if row.gender == 'male' else 'bye'

In [104]:
salutationFinder( orders.iloc[3] )

'Dear Mr. Erickson'

In [105]:
orders['salutation'] = orders.apply( lambda row : str('Dear Mr. ' + row.last_name) if row.gender == 'male' else str('Dear Ms. ' + row.last_name), axis =1 )

In [106]:
######################
# AGGREGATES IN PANDAS

In [107]:
## Calculating Column Statistics

# df.column_name.command()

# The following table summarizes some common commands: 
# Command	Description
#     mean	Average of all values in column
#     std	Standard deviation
#     median	Median
#     max	Maximum value in column
#     min	Minimum value in column
#     count	Number of values in column
#     nunique	Number of unique values in column
#     unique	List of unique values in column

In [108]:
## Once more, we’ll revisit our orders from ShoeFly.com. Our new batch of orders is in the DataFrame orders. Examine the first 10 rows using the following code:

orders = pd.read_csv('orders.csv.txt')

In [109]:
orders.head(10)
#print( orders.head(10))

,id,first_name,last_name,email,shoe_type,shoe_material,shoe_color,price
0,41874,Kyle,Peck,KylePeck71@gmail.com,ballet flats,faux-leather,black,385.0
1,31349,Elizabeth,Velazquez,EVelazquez1971@gmail.com,boots,fabric,brown,388.0
2,43416,Keith,Saunders,KS4047@gmail.com,sandals,leather,navy,346.0
3,56054,Ryan,Sweeney,RyanSweeney14@outlook.com,sandals,fabric,brown,344.0
4,77402,Donna,Blankenship,DB3807@gmail.com,stilettos,fabric,brown,289.0
5,97148,Albert,Dillon,Albert.Dillon@gmail.com,wedges,fabric,brown,266.0
6,19998,Judith,Hewitt,JudithHewitt98@gmail.com,stilettos,leather,black,395.0
7,83290,Kayla,Hardin,Kayla.Hardin@gmail.com,stilettos,leather,white,241.0
8,77867,Steven,Blankenship,Steven.Blankenship@gmail.com,wedges,leather,navy,266.0
9,54885,Carol,Mclaughlin,CM3415@gmail.com,ballet flats,faux-leather,brown,440.0

In [110]:
# Our finance department wants to know the price of the most expensive pair of shoes purchased. Save your answer to the variable most_expensive.

most_expensive = orders.price.max()

In [111]:
# Our fashion department wants to know how many different colors of shoes we are selling. Save your answer to the variable num_colors.
num_colors = orders.shoe_color.nunique()

In [112]:
## Groupby 

# We want to get an average grade for each student across all assignments. We could do some sort of loop, but Pandas gives us a much easier option: the method .groupby.

# In general, we use the following syntax to calculate aggregates:

# df.groupby('column1').column2.measurement()

# where:

# column1 is the column that we want to group by ('student' in our example)
# column2 is the column that we want to perform a measurement on (grade in our example)
# measurement is the measurement function we want to apply (mean in our example)

orders.groupby('shoe_type').price.mean()

shoe_type
ballet flats    256.000000
boots           267.684211
clogs           310.625000
sandals         274.125000
stilettos       360.928571
wedges          277.777778
Name: price, dtype: float64

In [113]:
## Let’s return to our orders data from ShoeFly.com.

## In the previous exercise, our finance department wanted to know the most expensive shoe that we sold.

## Now, they want to know the most expensive shoe for each shoe_type (i.e., the most expensive boot, the most expensive ballet flat, etc.).

## Save your answer to the variable pricey_shoes.

In [114]:
pricey_shoes = orders.groupby('shoe_type').price.max()

In [115]:
print( pricey_shoes)

shoe_type
ballet flats    481.0
boots           478.0
clogs           493.0
sandals         456.0
stilettos       487.0
wedges          461.0
Name: price, dtype: float64

In [116]:
print( type( pricey_shoes))

<class 'pandas.core.series.Series'>

In [117]:
# Calculating Aggregate Functions III
# Sometimes, the operation that you want to perform is more complicated than mean or count. In those cases, you can use the apply method and lambda functions, just like we did for individual column operations. Note that the input to our lambda function will always be a list of values.

# A great example of this is calculating percentiles. Suppose we have a DataFrame of employee information called df that has the following columns:

# id: the employee’s id number
# name: the employee’s name
# wage: the employee’s hourly wage
# category: the type of work that the employee does
# Our data might look something like this:

# id	name	wage	category
# 10131	Sarah Carney	39	product
# 14189	Heather Carey	17	design
# 15004	Gary Mercado	33	marketing
# 11204	Cora Copaz	27	design
# …			
# If we want to calculate the 75th percentile (i.e., the point at which 75% of employees have a lower wage and 25% have a higher wage) for each category, we can use the following combination of apply and a lambda function:

# # np.percentile can calculate any percentile over an array of values
# high_earners = df.groupby('category').wage
#     .apply(lambda x: np.percentile(x, 75))
#     .reset_index()

# The output, high_earners might look like this:

# category	wage
# 0	design	23
# 1	marketing	35
# 2	product	48
# …

In [118]:
#orders
orders.groupby('shoe_material').id.count()
#orders.id

shoe_material
fabric          34
faux-leather    33
leather         32
Name: id, dtype: int64

In [119]:
### task

# Once more, we’ll return to the data from ShoeFly.com. Our Marketing team says that it’s important to have some affordably priced shoes available for every color of shoe that we sell.

# Let’s calculate the 25th percentile for shoe price for each shoe_color to help Marketing decide if we have enough cheap shoes on sale. Save the data to the variable cheap_shoes.

# Note: Be sure to use reset_index() at the end of your query so that cheap_shoes is a DataFrame.


#orders.groupby('shoe_color')['price'].apply( lambda x : np.percentile(x, 25) ).reset_index() 
cheap_shoes  = orders.groupby('shoe_color').price.apply( lambda x : np.percentile(x, 25) ).reset_index()

In [120]:

type( cheap_shoes )

#cheap_shoes

pandas.core.frame.DataFrame

In [121]:
# Calculating Aggregate Functions IV
# Sometimes, we want to group by more than one column. We can easily do this by passing a list of column names into the groupby method.

# Imagine that we run a chain of stores and have data about the number of sales at different locations on different days:

# Location	Date	Day of Week	Total Sales
# West Village	February 1	W	400
# West Village	February 2	Th	450
# Chelsea	February 1	W	375
# Chelsea	February 2	Th	390
# We suspect that sales are different at different locations on different days of the week. In order to test this hypothesis, we could calculate the average sales for each store on each day of the week across multiple months. The code would look like this:

# df.groupby(['Location', 'Day of Week'])['Total Sales'].mean().reset_index()

# The results might look something like this:

# Location	Day of Week	Total Sales
# Chelsea	M	402.50
# Chelsea	Tu	422.75
# Chelsea	W	452.00
# …		
# West Village	M	390
# West Village	Tu	400
# …

## NTS - in a groupby, you can reference the column to be calculated on using df.groupby(cols).column OR df.groupby(cols)['column'] - I'm not sure the difference

In [122]:
### task

# At ShoeFly.com, our Purchasing team thinks that certain shoe_type/shoe_color combinations are particularly popular this year (for example, blue ballet flats are all the rage in Paris).

# Create a DataFrame with the total number of shoes of each shoe_type/shoe_color combination purchased. Save it to the variable shoe_counts.

# You should be able to do this using groupby and count().

# Note: When we’re using count(), it doesn’t really matter which column we perform the calculation on. You should use id in this example, but we would get the same answer if we used shoe_type or last_name.

# Remember to use reset_index() at the end of your code!

shoe_counts = orders.groupby(['shoe_type', 'shoe_color']).id.count().reset_index()

In [123]:
# Pivot Tables
# When we perform a groupby across multiple columns, we often want to change how our data is stored. For instance, recall the example where we are running a chain of stores and have data about the number of sales at different locations on different days:

# Location	Date	Day of Week	Total Sales
# West Village	February 1	W	400
# West Village	February 2	Th	450
# Chelsea	February 1	W	375
# Chelsea	February 2	Th	390
# We suspected that there might be different sales on different days of the week at different stores, so we performed a `groupby` across two different columns (`Location` and `Day of Week`). This gave us results that looked like this:
# Location	Day of Week	Total Sales
# Chelsea	M	300
# Chelsea	Tu	310
# Chelsea	W	375
# Chelsea	Th	390
# …		
# West Village	Th	450
# West Village	F	390
# West Village	Sa	250
# …		
# In order to test our hypothesis, it would be more useful if the table was formatted like this:
# Location	M	Tu	W	Th	F	Sa	Su
# Chelsea	300	310	375	390	300	150	175
# West Village	300	310	400	450	390	250	200
# …							
# Reorganizing a table in this way is called pivoting. The new table is called a pivot table.

# In Pandas, the command for pivot is:

# df.pivot(columns='ColumnToPivot',
#          index='ColumnToBeRows',
#          values='ColumnToBeValues')

# For our specific example, we would write the command like this:

# # First use the groupby statement:
# unpivoted = df.groupby(['Location', 'Day of Week'])['Total Sales'].mean().reset_index()
# # Now pivot the table
# pivoted = unpivoted.pivot(
#     columns='Day of Week',
#     index='Location',
#     values='Total Sales')

# Just like with groupby, the output of a pivot command is a new DataFrame, but the indexing tends to be “weird”, so we usually follow up with .reset_index().

# For more on the pivot function, see the pandas documentation.

In [124]:
orders

,id,first_name,last_name,email,shoe_type,shoe_material,shoe_color,price
0,41874,Kyle,Peck,KylePeck71@gmail.com,ballet flats,faux-leather,black,385.0
1,31349,Elizabeth,Velazquez,EVelazquez1971@gmail.com,boots,fabric,brown,388.0
2,43416,Keith,Saunders,KS4047@gmail.com,sandals,leather,navy,346.0
3,56054,Ryan,Sweeney,RyanSweeney14@outlook.com,sandals,fabric,brown,344.0
4,77402,Donna,Blankenship,DB3807@gmail.com,stilettos,fabric,brown,289.0
...,...,...,...,...,...,...,...,...
94,21506,Scott,Deleon,Scott.Deleon@gmail.com,stilettos,fabric,black,374.0
95,77266,Zachary,Gregory,Zachary.Gregory@gmail.com,sandals,leather,red,216.0
96,67264,Danielle,Merrill,DMerrill1998@gmail.com,wedges,faux-leather,red,461.0
97,19100,Danielle,Barron,DBarron1982@gmail.com,sandals,leather,white,313.0
98,26210,Marilyn,Finch,MarilynFinch92@gmail.com,sandals,leather,black,NaN

In [125]:
groupedOrders = orders.groupby(['shoe_type','shoe_material']).price.sum().reset_index()

In [126]:
groupedOrders.pivot( columns= 'shoe_material', index = 'shoe_type', values = 'price')

shoe_material  fabric  faux-leather  leather
shoe_type
ballet flats    831.0        2090.0    919.0
boots          2233.0        1514.0   1339.0
clogs          1134.0         819.0   3017.0
sandals        1954.0        1231.0   1201.0
stilettos      2019.0         838.0   2196.0
wedges         1523.0        2528.0    949.0

In [127]:
### TASK

# In the previous example, you created a DataFrame with the total number of shoes of each shoe_type/shoe_color combination purchased for ShoeFly.com.

# The purchasing manager complains that this DataFrame is confusing.

# Make it easier for her to compare purchases of different shoe colors of the same shoe type by creating a pivot table. Save your results to the variable shoe_counts_pivot.

# Your table should look like this:

# shoe_type	black	brown	navy	red	white
# ballet flats	…	…	…	…	…
# sandals	…	…	…	…	…
# stilettos	…	…	…	…	…
# wedges	…	…	…	…	…
# Remember to use reset_index() at the end of your code!

groupedOrders = orders.groupby(['shoe_type','shoe_color']).id.count().reset_index()

shoe_counts_pivot = groupedOrders.pivot( columns= 'shoe_color', index = 'shoe_type', values = 'id').reset_index()

In [128]:
### REVIEW

# This lesson introduced you to aggregates in Pandas. You learned:

# How to perform aggregate statistics over individual rows with the same value using groupby.
# How to rearrange a DataFrame into a pivot table, a great way to compare data across two dimensions.
# Instructions
# Checkpoint 1 Enabled
# 1.
# Let’s examine some more data from ShoeFly.com. This time, we’ll be looking at data about user visits to the website (the same dataset that you saw in the introduction to this lesson).

# The data is a DataFrame called user_visits. Use print and head() to examine the first few rows of the DataFrame.

In [129]:
#user_visits = pd.read_csv('page_visits.csv.txt')

In [130]:
#user_visits

In [131]:
# The column utm_source contains information about how users got to ShoeFly’s homepage. For instance, if utm_source = Facebook, then the user came to ShoeFly by clicking on an ad on Facebook.com.

# Use a groupby statement to calculate how many visits came from each of the different sources. Save your answer to the variable click_source.

# Remember to use reset_index()!

In [132]:
#click_source = user_visits.groupby('utm_source').id.count().reset_index()

In [133]:
# Our Marketing department thinks that the traffic to our site has been changing over the past few months. Use groupby to calculate the number of visits to our site from each utm_source for each month. Save your answer to the variable click_source_by_month.

In [134]:
#click_source_by_month = user_visits.groupby(['utm_source', 'month']).id.count().reset_index()

In [135]:
#click_source_by_month

In [136]:
# The head of Marketing is complaining that this table is hard to read. Use pivot to create a pivot table where the rows are utm_source and the columns are month. Save your results to the variable click_source_by_month_pivot.

# It should look something like this:

# utm_source	1 - January	2 - February	3 - March
# email	…	…	…
# facebook	…	…	…
# google	…	…	…
# twitter	…	…	…
# yahoo	…	…	…

In [137]:

#click_source_by_month.pivot( columns = 'month' , index = 'utm_source', values = 'id' ).reset_index()
#click_source_by_month_pivot = click_source_by_month.pivot( columns = 'month' , index = 'utm_source', values = 'id' ).reset_index()

In [138]:
### A/B Testing for ShoeFly.com
# Our favorite online shoe store, ShoeFly.com is performing an A/B Test. They have two different versions of an ad, which they have placed in emails, as well as in banner ads on Facebook, Twitter, and Google. They want to know how the two ads are performing on each of the different platforms on each day of the week. Help them analyze the data using aggregate measures.

# If you get stuck during this project or would like to see an experienced developer work through it, click “Get Unstuck“ to see a project walkthrough video.

In [139]:
ad_clicks = pd.read_csv('ad_clicks.csv.txt')

In [140]:
ad_clicks.head()

,user_id,utm_source,day,ad_click_timestamp,experimental_group
0,008b7c6c-7272-471e-b90e-930d548bd8d7,google,6 - Saturday,7:18,A
1,009abb94-5e14-4b6c-bb1c-4f4df7aa7557,facebook,7 - Sunday,NaN,B
2,00f5d532-ed58-4570-b6d2-768df5f41aed,twitter,2 - Tuesday,NaN,A
3,011adc64-0f44-4fd9-a0bb-f1506d2ad439,google,2 - Tuesday,NaN,B
4,012137e6-7ae7-4649-af68-205b4702169c,facebook,7 - Sunday,NaN,B

In [141]:
# Your manager wants to know which ad platform is getting you the most views.

# How many views (i.e., rows of the table) came from each utm_source?

    #ad_clicks.groupby('utm_source').user_id.count().reset_index()

In [142]:
# If the column ad_click_timestamp is not null, then someone actually clicked on the ad that was displayed.

# Create a new column called is_click, which is True if ad_click_timestamp is not null and False otherwise.

ad_clicks['is_click'] = ad_clicks.apply( lambda row : True if pd.notnull(row.ad_click_timestamp) else False  , axis = 1)

In [143]:
# We want to know the percent of people who clicked on ads from each utm_source.

# Start by grouping by utm_source and is_click and counting the number of user_id‘s in each of those groups. Save your answer to the variable clicks_by_source.

clicks_by_source = ad_clicks.groupby(['utm_source', 'is_click']).user_id.count().reset_index()

In [144]:
#clicks_by_source

In [145]:
# Now let’s pivot the data so that the columns are is_click (either True or False), the index is utm_source, and the values are user_id.

# Save your results to the variable clicks_pivot.

clicks_pivot = clicks_by_source.pivot( columns = 'is_click', index = 'utm_source', values = 'user_id' )

In [146]:
clicks_pivot
#type(clicks_pivot)

is_click    False  True
utm_source
email         175    80
facebook      324   180
google        441   239
twitter       149    66

In [147]:
# Create a new column in clicks_pivot called percent_clicked which is equal to the percent of users who clicked on the ad from each utm_source.

# Was there a difference in click rates for each source?

    #clicks_pivot.apply( lambda row : row[True] , axis = 1 )

    #clicks_pivot['percent_clicked'] = clicks_pivot.apply( lambda row : row.user_id + row.is_click )
clicks_pivot['percent_clicked'] = round(( clicks_pivot[True] / ( clicks_pivot[True] + clicks_pivot[False] ) ) * 100 , 2)

In [148]:
# The column experimental_group tells us whether the user was shown Ad A or Ad B.

# Were approximately the same number of people shown both ads? --- YES

ad_clicks.groupby('experimental_group').user_id.count()

experimental_group
A    827
B    827
Name: user_id, dtype: int64

In [149]:
# Using the column is_click that we defined earlier, check to see if a greater percentage of users clicked on Ad A or Ad B.

ad_clicks.groupby(['experimental_group', 'is_click']).user_id.count()

experimental_group  is_click
A                   False       517
                    True        310
B                   False       572
                    True        255
Name: user_id, dtype: int64

In [150]:
ad_clicks_grouped = ad_clicks.groupby(['experimental_group', 'is_click']).user_id.count().reset_index()

In [151]:
ad_clicks_grouped

  experimental_group  is_click  user_id
0                  A     False      517
1                  A      True      310
2                  B     False      572
3                  B      True      255

In [152]:
ad_clicks_grouped_pivot = ad_clicks_grouped.pivot( columns = 'is_click', index = 'experimental_group', values = 'user_id' )

In [153]:
ad_clicks_grouped_pivot['percent_clicked'] = round(( ad_clicks_grouped_pivot[True] / ( ad_clicks_grouped_pivot[True] + ad_clicks_grouped_pivot[False] ) ) * 100 , 2)

In [154]:
ad_clicks_grouped_pivot

is_click            False  True  percent_clicked
experimental_group
A                     517   310            37.48
B                     572   255            30.83

In [157]:
# The Product Manager for the A/B test thinks that the clicks might have changed by day of the week.

# Start by creating two DataFrames: a_clicks and b_clicks, which contain only the results for A group and B group, respectively.

    #ad_clicks.apply( lambda row : row if row[experimental_group] == 'A', axis = 1 )

SyntaxError: invalid syntax (Temp/ipykernel_22612/2058740462.py, line 5)

In [161]:
a_clicks = ad_clicks[ ad_clicks.experimental_group == 'A']
b_clicks = ad_clicks[ ad_clicks.experimental_group == 'B']

In [163]:
#b_clicks

,user_id,utm_source,day,ad_click_timestamp,experimental_group,is_click
1,009abb94-5e14-4b6c-bb1c-4f4df7aa7557,facebook,7 - Sunday,NaN,B,False
3,011adc64-0f44-4fd9-a0bb-f1506d2ad439,google,2 - Tuesday,NaN,B,False
4,012137e6-7ae7-4649-af68-205b4702169c,facebook,7 - Sunday,NaN,B,False
9,01a210c3-fde0-4e6f-8efd-4f0e38730ae6,email,2 - Tuesday,15:21,B,True
10,01adb2e7-f711-4ae4-a7c6-29f48457eea1,google,3 - Wednesday,NaN,B,False
...,...,...,...,...,...,...
1645,fd2a5852-f0ef-4162-84a6-107a42dc46b5,twitter,3 - Wednesday,NaN,B,False
1648,fe6cfa5a-cc63-4770-8d56-c13ac8cf5bef,google,3 - Wednesday,15:6,B,True
1650,fed3db6d-8c92-40e3-a4fb-1fb9d7337eb1,facebook,5 - Friday,NaN,B,False
1651,ff3a22ff-521c-478c-87ca-7dc7b8f34372,twitter,3 - Wednesday,NaN,B,False
1653,ffdfe7ec-0c74-4623-8d90-d95d80f1ba34,facebook,6 - Saturday,NaN,B,False

In [ ]:
#For each group (a_clicks and b_clicks), calculate the percent of users who clicked on the ad by day.

In [175]:
#a_clicks.groupby( 'day' ).user_id.count().reset_index()
a_clicks.groupby( [ 'is_click', 'day' ] ).user_id.count().reset_index()

    is_click            day  user_id
0      False     1 - Monday       70
1      False    2 - Tuesday       76
2      False  3 - Wednesday       86
3      False   4 - Thursday       69
4      False     5 - Friday       77
5      False   6 - Saturday       73
6      False     7 - Sunday       66
7       True     1 - Monday       43
8       True    2 - Tuesday       43
9       True  3 - Wednesday       38
10      True   4 - Thursday       47
11      True     5 - Friday       51
12      True   6 - Saturday       45
13      True     7 - Sunday       43